# encoding: utf-8

def first_names

  %w(亚 瑷珲 亚荣 亚德 恩德 亚伦 荣 亚龙 艾文 恩义 安 安乐 博茗 薄 博文 波 博 博茗 凯 克 承杰 凯瑞 凯威 承荣 斯凯 成帅 长歌 承荣 臣旭
   成利 成蓝 德 丹 鸽 道格 歌 德业 德恩 德锐 德华 大卫 大伟 达 爱 德华 皑 德 耳 尔 文 瞹文 皑 瞹文 峰 飞 福 得福 福 丰羽 飞鸿 风华
   飞鹏 加 格 刚 高峰 光熙 高瑞 刚捷 刚 高 广 鸿昌 鸿博 弘益 华睿 涵润 鸿朗 宏盛 和畅 皓瑜 泓轩 浩名 易 易然 昱梁 玉琨 玉梁 昱梁
   誉斌 伊凡 伊 泛 亚 籍泽 建虎 敬一 嘉绚 家帮 克勤 克 津蒙 家珲 凯 康 克 康 克 凯恩 凯文 康凯 亚 林一 良 利 兰 乐 雷 利 利强 乐 来 名复
   鸣锟 铭可 名臣 明晨 名瑞 孟然 鸣坤 铭可 鸣锟 铭昕 旻天 诺天 南岐 南驿 昊 浩 傲 欧洋 鹏 友朋 少奇 博 鹏飞 奇略 濮存 培丞 奇 奇瑗
   卿池 骐硕 睿竹 瑞浩 仁 若瞳 糅皓 睿冰 任彪 仁博 瑞宇 睿琀 瑞政 瑞德 燃狄 若林 荣庆 若珊 瑞士 瑞山 睿耘 如愿 芮瑜 斯 诗禺 韶元
   诗畅 释遥 士彦 世赫 世洪 适晨 世桐 世晖 时安 适诚 世晓 世松 仕元 十棠 士涛 柿君 天 涛 同 天承 天伊 庭顺 涛 波涛 同 天承 拓堂 一昭
   阳宏 言梁 威 炜峰 唯炜 文森 万江 伟 卫 维维 威龙 伟荣 威廉 伟 亚德 彦龙 学友 易 逸 毅 召辉 自强 志祥 安 奥雅 安琪 安卉 安祯 荌荌
   荣 安琪 安吉 安 安娴 安娜 博雅 博敏 荣 蓓蕾 蓓 碧琳 碧莹 春芳 晨曦 采文 琛瑞 凯瑞 聪睿 偲偲 朝旭 长歌 春兰 春岚 琛丽 成利 成蓝
   丹丹 丹 丹彤 黛玉 歌 黛娥 德恩 德锐 德 依依 仪 伊娜 伊利 伊莉 瑷 伊娜 伊莉 婀娜 尔雅 爱莎 霏霏 芬菲 芙蓉 高洁 格菲 桂帆 吉祥 谷雪
   歌韵 古兰 古丽 会雯 会欣 彗云 浩丽 红旭 蕙若 海燕 浩岚 晗玥 仪 伊扬 洁 吉 洁雅 洁静 吉欣 杰秀 姣妍 乔 俏 娟丽 君丽 珺俐 可可 可欣
   可心 凯瑞 可欣 可嘉 凯瑞 可欣 可可 丽 莉 利珂 丽珠 灵萱 丽 莉 莉莉 玲玲 灵秀 兰泽 梦凡 曼妮 萌萌 梦菲 梦秋 梦琪 曼丽 美丽 梦露
   曼妮 梦琪 曼语 梦竹 曼妮 妮 燕妮 傲梅 沛若 平婉 沛珊 佩兰 萍雅 秋香 清绮 清怡 蓉 茹 若兰 若兰 蓉 志 萌 志萌 强
   蓉 茹 诗诗 思语 淑婉 思涵 思嘉 思敏 邵美 思娜 思楠 丝柳 淑兰 诗蕾 甜恬 彤蕊 彤彤 恬畅 婷 恬然 婷然 恬然 婷然 恬欣 恬静 天欣 茹 薇
   薇薇 婉清 文惠 婉柔 未央 婉容 婉奕 婉丽 韦茹 微澜 琬凝 婉仪 心语 心怡 忻然 希蓉 心诺 欣彤 雅 雅洁 叶欣 燕楠 一璇 晏如 逸云 蕴涵
   竹萱 子欣 芷兰 贞怡)

end
